export interface RLS {
  label: string;
  order: number;
  description: string;
}

export const modes = {
  0: { message: 'Походный режим', classes: 'bg-green' },
  1: { message: 'Боевой режим', classes: 'bg-red' },
  2: { message: 'Не удалось определить режим', classes: 'bg-grey' },
};

export const points = [
  {
    lat: [43.0, 35.937],
    lon: [-42.328, -10.268],
    color: 'green',
  },
  {
    lat: [16.0, 35.837],
    lon: [-47.328, -10.168],
    color: 'green',
  },
  {
    lat: [30.0, 36.5],
    lon: [-64.328, -10.378],
    color: 'green',
  },
  {
    lat: [36.0, 35.0],
    lon: [-64.328, -10.378],
    color: 'green',
  },
  {
    lat: [8.384201269654303, 31.607590517511262],
    lon: [-37.71641127386515, -13.063090961365152],
    color: 'green',
  },
  {
    lat: [-1.8925763296161204, 13.378227523781447],
    lon: [82.18996568668972, 51.076684436689696],
    color: 'blue',
  },
  {
    lat: [-19.38094046048743, 13.378227523781447],
    lon: [63.7329344366897, 51.076684436689696],
    color: 'blue',
  },
  {
    lat: [-2.0694350055142405, 13.378227523781447],
    lon: [55.506371936689725, 51.076684436689696],
    color: 'blue',
  },
  {
    lat: [15.092778694989404, 13.648227523781447],
    lon: [51.076684436689696, 52.076684436689696],
    color: 'blue',
  },
  {
    lat: [30.497004046625687, 13.648227523781447],
    lon: [-81.6821978564928, 52.076684436689696],
    color: 'brown',
  },
];

export const rlsList: Array<RLS> = [
  {
    label: 'AN/SPY-1',
    order: 1,
    description:
      'Радиолокационная станция, установленная на авианосцах и других кораблях для обнаружения и отслеживания воздушных целей.',
  },
  {
    label: 'AN/SPS-48',
    order: 1,
    description:
      'Радиолокационная станция, используемая для обнаружения и отслеживания воздушных и поверхностных целей на больших дистанциях.',
  },
  {
    label: 'AN/SPQ-9B',
    order: 1,
    description:
      'Радиолокационная станция для обнаружения и отслеживания морских и воздушных целей',
  },
  {
    label: 'AN /SPN-46',
    order: 1,
    description:
      'Американский корабельный радар компании Textron Systems, используемый на авианосцах ВМС США в системах автоматической посадки на авианосец и точного захода на посадку.',
  },
  {
    label: 'AN/SPN-41',
    order: 1,
    description:
      'Американская корабельная система полуавтоматической посадки, используемая на авианосцах и универсальных десантных кораблях ВМС США ',
  },
  {
    label: 'AN/SPG-62',
    order: 1,
    description:
      'Американский радар непрерывного излучения системы «Иджис», выполняет функцию подсветки цели на конечном участке наведения ракет «Стандарт» SM-2. ',
  },
  {
    label: 'AN/SPS-49',
    order: 0,
    description:
      'Радиолокационная станция, применяемая для поиска и обнаружения кораблей на больших расстояниях во время операций в флоте.',
  },
  {
    label: 'AN/SPS-67',
    order: 0,
    description:
      'Радиолокационная станция для обнаружения низколетящих воздушных целей.',
  },
  {
    label: 'AN/SPS-73',
    order: 0,
    description:
      'Радиолокационная станция для обнаружения поверхностных и воздушных целей на маленьких и средних дистанциях.',
  },
  {
    label: 'AN/SPS-64',
    order: 0,
    description:
      'Он же Mariners Pathfinder – это универсальный радар для наблюдения за морской поверхностью и навигации, обладающий улучшенными техническими характеристиками',
  },
  {
    label: 'AN/SPS-55',
    order: 0,
    description: 'Двухкоординатная навигационная РЛС и РЛС обзора поверхности.',
  },
  {
    label: 'AN/APS-125',
    order: 0,
    description: 'Двухкоординатная навигационная РЛС и РЛС обзора поверхности.',
  },
  {
    label: 'AN/APS-128',
    order: 0,
    description: 'Двухкоординатная навигационная РЛС и РЛС обзора поверхности.',
  },
  {
    label: 'AN/ARN-118',
    order: 0,
    description: 'Двухкоординатная навигационная РЛС и РЛС обзора поверхности.',
  },
];

export const rows = [
  {
    name: 'Авианосец\n«Нимиц»\n(CVN-68)',
    rls: [
      'AN/SPS-48E',
      'AN/SPS-49(V)5',
      'AN/SPN-46',
      'AN/SPN-43C',
      'AN/SPN-41',
      'AN/SPQ-9B',
    ],
    freq: [
      '2900-3100',
      '880-910',
      '3590-3700;33000-33400',
      '33000-33400;',
      '15400-15700',
      '8500-9600',
    ],
    repeat: ['1000-2350', '3.3-4.85', '2000', '1125', '3150-3500', '900'],
    power: ['2400', '360', '50', '50', '2', '1200'],
    gain: ['38.5', '38', '30', '50', '30', '37.5'],
  },
  {
    name: 'Kрейсера типа \n«Тикондерог»',
    rls: ['AN/SPY-1A', 'AN/SPS-49', 'AN/SPS-55', 'AN/SPG-62', 'AN/SPQ-9A'],
    freq: ['3100-3900', '850-950', '9050-10000', '8500-9600', '8500-9600'],
    repeat: [
      '40;600;1430',
      '1;1.21;3.5;3.71; 4.19',
      '720-790',
      '2500-3500',
      '900',
    ],
    power: ['4000-6000', '280', '130', '45051', '1200'],
    gain: ['42', '38', '37.5', '41.5', '37.5'],
  },
  {
    name: 'Эскадренный миноносец \nтипа «Арли Берк»',
    rls: [
      'AN/SPY-1D',
      'AN/SPS-49',
      'AN/SPS-55',
      'AN/SPG-62',
      'AN/SPS-67',
      'AN/SPS-64',
    ],
    freq: [
      '3100-3900',
      '850-950',
      '9050-10000',
      '8500-9600',
      '5380-5580',
      '3025-3075;9345-9405',
    ],
    repeat: [
      '40;600;1430',
      '1;1.21;3.5;3.71; 4.19',
      '720-790',
      '2500-3500',
      '900',
    ],
    power: ['4000-6000', '280', '130', '5,5', '500', '50'],
    gain: ['42', '38', '37.5', '41.5', '30', '41.5'],
  },
  {
    name: 'Атомный авианосец \n"Джон К. Стеннис" \n(CVN-74)',
    rls: [
      'AN/SPS-48E',
      'AN/SPS-49 (V) 5 2-D',
      'AN/SPQ-9B',
      'AN/SPN-46',
      'AN/SPN-41',
    ],
    freq: [
      '2900-3100',
      '850-950;851-880;880-910;911-942',
      '8500-9600',
      '3590-3700;33000-33400',
      '15400-15700',
    ],
    repeat: ['1000-2350', '1-1.6; 2.3; 125', '900', '2000', '3150-3500'],
    power: ['2400', '280;360', '1200', '50', '2'],
    gain: ['38.5', '38', '37.5', '30', '-'],
  },
  {
    name: 'Атомный авианосец \n«Джордж Вашингтон» (CVN-73)',
    rls: [
      'AN/SPS-48E',
      'AN/SPS-49 (V) 5 2-D',
      'AN/SPQ-9B',
      'AN/SPN-46',
      'AN/SPN-41',
      'AN/SPN-43C',
    ],
    freq: [
      '2900-3100',
      '850-950;851-880;880-910;911-942',
      '8500-9600',
      '3590-3700;33000-33400',
      '15400-15700',
      '33000-33400',
    ],
    repeat: [
      '1000-2350',
      '1-1.6; 2.3; 125',
      '900',
      '2000',
      '3150-3500',
      '1125',
    ],
    power: ['2400', '280;360', '1200', '50', '2', '50'],
    gain: ['38.5', '38', '37.5', '30', '-', '50'],
  },
  {
    name: 'Авианосец \n«Рональд Рейган» (CVN-76)',
    rls: [
      'AN/SPS-48E',
      'AN/SPS-49A (V)',
      'AN/SPQ-9B',
      'AN/SPN-46',
      'AN/SPN-43C',
      'AN/SPN-41',
    ],
    freq: [
      '2900-3100',
      '850-950;851-880;880-910;911-942',
      '8500-9600',
      '3590-3700;33000-33400',
      '33000-33400',
      '15400-15700',
    ],
    repeat: [
      '1000-2350',
      '1-1.6; 2.3; 125',
      '900',
      '2000',
      '1125',
      '3150-3500',
    ],
    power: ['2400', '280;360', '1200', '50', '50', '2'],
    gain: ['38.5', '38', '37.5', '30', '50', '-'],
  },
  {
    name: '(CVN-70 «Карл Винсон»)',
    rls: [
      'AN/SPS-48E',
      'AN/SPS-49A (V)',
      'AN/SPQ-9B',
      'AN/SPN-46',
      'AN/SPN-43C',
      'AN/SPN-41',
    ],
    freq: [
      '2900-3100',
      '850-950;851-880;880-910;911-942',
      '8500-9600',
      '3590-3700;33000-33400',
      '33000-33400',
      '15400-15700',
    ],
    repeat: [
      '1000-2350',
      '1-1.6; 2.3; 125',
      '900',
      '2000',
      '1125',
      '3150-3500',
    ],
    power: ['2400', '280;360', '1200', '50', '50', '2'],
    gain: ['38.5', '38', '37.5', '30', '50', '-'],
  },
];
